from .log import log

def init():
    print('\033[1;32;40m  _____   __   _   _____   _   _    _____  __    __ ' + '\033[0m')
    print('\033[1;32;40m /  _  \\ |  \\ | | | ____| | | / /  | ____| \\ \\  / /' + '\033[0m')
    print('\033[1;32;40m | | | | |   \\| | | |__   | |/ /   | |__    \\ \\/ /' + '\033[0m')
    print('\033[1;32;40m | | | | | |\\   | |  __|  | |\\ \\   |  __|    \\  / ' + '\033[0m')
    print('\033[1;32;40m | |_| | | | \\  | | |___  | | \\ \\  | |___    / /' + '\033[0m')
    print('\033[1;32;40m \\_____/ |_|  \\_| |_____| |_|  \\_\\ |_____|  /_/' + '\033[0m')
    log.info('作者ikun0014')
    log.info('本项目基于wxy1343/ManifestAutoUpdate进行修改，采用ACSL许可证')
    log.info('版本：1.1.9')
    log.info('项目仓库：https://github.com/ikunshare/Onekey')
    log.info('官网：ikunshare.com')
    log.warning('本项目完全开源免费，如果你在淘宝，QQ群内通过购买方式获得，赶紧回去骂商家死全家\n交流群组：\n点击链接加入群聊【𝗶𝗸𝘂𝗻分享】：https://qm.qq.com/q/d7sWovfAGI\nhttps://t.me/ikunshare_group')